
<!DOCTYPE html>
<html lang="en">
    
<head>
    <meta http-equiv="Content-Type" content="text/html" charset="UTF-8" >
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="generator" content="To Be Better">
    <title>Archives: 2016 - To Be Better</title>
    <meta name="author" content="Eddy Chen">
    
        <meta name="keywords" content="eddy chen,Eddy Chen,hexo,javascript,">
    
    
    
        <link rel="alternate" type="application/atom+xml" title="RSS" href="/atom.xml">
    
    <meta name="description">
<meta property="og:type" content="blog">
<meta property="og:title" content="To Be Better">
<meta property="og:url" content="http://yoursite.com/archives/2016/index.html">
<meta property="og:site_name" content="To Be Better">
<meta property="og:description">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="To Be Better">
<meta name="twitter:description">
<meta name="twitter:creator" content="@eddychen">
    
    
        
    
    
        <meta property="og:image" content="http://yoursite.com/assets/images/cover.jpg"/>
    
    
    
    
    <!--STYLES-->
    <link rel="stylesheet" href="/assets/css/style-ejlztp1tasruqfvoz6xmgqng0anzae8ox7cqjj5yibieqgcmhe9fwxfae6zj.min.css" type="text/css">
    <!--STYLES END-->
    
    
</head>

    <body>
        <div id="blog">
            <!-- Define author's picture -->


<header id="header" data-behavior="1">
    <i id="btn-open-sidebar" class="fa fa-lg fa-bars"></i>
    <h1 class="header-title">
        <a class="header-title-link" href="/ ">To Be Better</a>
    </h1>
    
        
            <a  class="header-right-icon st-search-show-outputs"
                href="/#search">
        
        
            <i class="fa fa-lg fa-search"></i>
        
        </a>
    
</header>

            <!-- Define author's picture -->



        
    

<nav id="sidebar" data-behavior="1">
    
        <div class="sidebar-profile">
            <a href="/#about">
                    <img class="sidebar-profile-picture" src="/assets/images/cover.jpg"/>
            </a>
            <span class="sidebar-profile-name">Eddy Chen</span>
        </div>
    
    
        <ul class="sidebar-buttons">
        
            <li class="sidebar-button">
                
                    <a  class="sidebar-button-link "
                         href="/ "
                        
                    >
                
                    <i class="sidebar-button-icon fa fa-lg fa-home"></i>
                    <span class="sidebar-button-desc">Home</span>
                </a>
        </li>
        
            <li class="sidebar-button">
                
                    <a  class="sidebar-button-link "
                         href="/all-categories"
                        
                    >
                
                    <i class="sidebar-button-icon fa fa-lg fa-bookmark"></i>
                    <span class="sidebar-button-desc">Categories</span>
                </a>
        </li>
        
            <li class="sidebar-button">
                
                    <a  class="sidebar-button-link "
                         href="/all-tags"
                        
                    >
                
                    <i class="sidebar-button-icon fa fa-lg fa-tags"></i>
                    <span class="sidebar-button-desc">Tags</span>
                </a>
        </li>
        
            <li class="sidebar-button">
                
                    <a  class="sidebar-button-link "
                         href="/all-archives"
                        
                    >
                
                    <i class="sidebar-button-icon fa fa-lg fa-archive"></i>
                    <span class="sidebar-button-desc">Archives</span>
                </a>
        </li>
        
            <li class="sidebar-button">
                
                    <a  class="sidebar-button-link st-search-show-outputs"
                         href="/#search"
                        
                    >
                
                    <i class="sidebar-button-icon fa fa-lg fa-search"></i>
                    <span class="sidebar-button-desc">Search</span>
                </a>
        </li>
        
            <li class="sidebar-button">
                
                    <a  class="sidebar-button-link "
                         href="/#about"
                        
                    >
                
                    <i class="sidebar-button-icon fa fa-lg fa-question"></i>
                    <span class="sidebar-button-desc">About</span>
                </a>
        </li>
        
    </ul>
    
        <ul class="sidebar-buttons">
        
            <li class="sidebar-button">
                
                    <a  class="sidebar-button-link " href="https://github.com/eddywjchen" target="_blank">
                
                    <i class="sidebar-button-icon fa fa-lg fa-github"></i>
                    <span class="sidebar-button-desc">GitHub</span>
                </a>
        </li>
        
    </ul>
    
        <ul class="sidebar-buttons">
        
            <li class="sidebar-button">
                
                    <a  class="sidebar-button-link "
                         href="/atom.xml"
                        
                    >
                
                    <i class="sidebar-button-icon fa fa-lg fa-rss"></i>
                    <span class="sidebar-button-desc">RSS</span>
                </a>
        </li>
        
    </ul>
    
</nav>

            
            <div id="main" data-behavior="1"
                 class="
                        hasCoverMetaIn
                        ">
                
    

<section class="postShorten-group main-content-wrap">
    
    
    <article class="postShorten postShorten--thumbnailimg-bottom" itemscope itemType="http://schema.org/BlogPosting">
        <div class="postShorten-wrap">
            <div class="postShorten-header">
                <h1 class="postShorten-title" itemprop="headline">
                    
                        <a class="link-unstyled" href="/2016/02/23/expectations_in_2016/">
                            2016年的一些想法
                        </a>
                    
                </h1>
                <div class="postShorten-meta">
    <time itemprop="datePublished" content="Tue Feb 23 2016 00:04:40 GMT+0800">
	
		    Feb 23, 2016
    	
    </time>
    
</div>
            </div>
            
            
                <div class="postShorten-content" itemprop="articleBody">
                    <h3 id="u5DE5_u4F5C_u4E0A"><a href="#u5DE5_u4F5C_u4E0A" class="headerlink" title="&#x5DE5;&#x4F5C;&#x4E0A;"></a>&#x5DE5;&#x4F5C;&#x4E0A;</h3><ul>
<li><p><strong><em>&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x4E3B;&#x5BFC;&#x4E00;&#x4E2A;&#x65B0;&#x9879;&#x76EE;&#x7684;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;</em></strong>&#x3002;&#x901A;&#x8FC7;&#x4E3B;&#x5BFC;&#x4E00;&#x4E2A;&#x65B0;&#x9879;&#x76EE;&#xFF0C;&#x63D0;&#x9AD8;&#x81EA;&#x5DF1;&#x5728;&#x9700;&#x6C42;&#x83B7;&#x53D6;&#xFF0C;&#x9700;&#x6C42;&#x6F84;&#x6E05;&#xFF0C;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x65B9;&#x9762;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x5728;&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#x8FD9;&#x4E00;&#x8584;&#x5F31;&#x73AF;&#x8282;&#x53BB;&#x505A;&#x66F4;&#x591A;&#x6C89;&#x6DC0;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x4E3B;&#x5BFC;&#x4E00;&#x4E2A;&#x65B0;&#x9879;&#x76EE;&#x5BF9;&#x6C9F;&#x901A;&#x534F;&#x4F5C;&#xFF0C;&#x8BA1;&#x5212;&#x5B89;&#x6392;&#x7B49;&#x8F6F;&#x80FD;&#x529B;&#x8981;&#x6C42;&#x66F4;&#x9AD8;&#xFF0C;&#x80FD;&#x591F;&#x8BA9;&#x4E2A;&#x4EBA;&#x7EFC;&#x5408;&#x80FD;&#x529B;&#x5F97;&#x5230;&#x5145;&#x5206;&#x953B;&#x70BC;&#x3002;</p>
</li>
<li><p><strong><em>&#x5728;&#x6C9F;&#x901A;&#x6280;&#x5DE7;&#x4E0A;&#x53EF;&#x4EE5;&#x518D;&#x505A;&#x63D0;&#x5347;</em></strong>&#x3002;&#x6C9F;&#x901A;&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5206;&#x51FA;&#x8C01;&#x5BF9;&#x8C01;&#x9519;&#x3002;&#x4E0D;&#x8981;&#x4E00;&#x5473;&#x7684;&#x53BB;&#x5426;&#x51B3;&#x4ED6;&#x4EBA;&#x4E0E;&#x4F60;&#x4E0D;&#x540C;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x662F;&#x53BB;&#x503E;&#x542C;&#x3002;&#x5728;&#x8868;&#x8FF0;&#x81EA;&#x5DF1;&#x60F3;&#x6CD5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8981;&#x6761;&#x7406;&#x6E05;&#x6670;&#xFF0C;&#x6709;&#x7406;&#x6709;&#x636E;&#x3002;&#x5728;&#x6C9F;&#x901A;&#x60C5;&#x7EEA;&#x65B9;&#x9762;&#xFF0C;&#x5C31;&#x7B97;&#x8BA4;&#x4E3A;&#x81EA;&#x5DF1;&#x662F;&#x5BF9;&#x7684;&#x6216;&#x8005;&#x4E8B;&#x5B9E;&#x4E0A;&#x81EA;&#x5DF1;&#x4E5F;&#x662F;&#x5BF9;&#x7684;&#xFF0C;&#x4E5F;&#x8981;&#x4EE5;&#x5E73;&#x548C;&#x7684;&#x60C5;&#x7EEA;&#x53BB;&#x9610;&#x8FF0;&#x81EA;&#x5DF1;&#x7684;&#x60F3;&#x6CD5;&#x3002;&#x5728;&#x5360;&#x636E;&#x9AD8;&#x4F4D;&#x7684;&#x6C9F;&#x901A;&#x4E2D;&#xFF08;&#x5E2E;&#x4EBA;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x6216;&#x8005;&#x9879;&#x76EE;transfer&#x65F6;&#x5019;&#xFF09;&#xFF0C;&#x8981;&#x4FDD;&#x6301;&#x8010;&#x5FC3;&#xFF0C;&#x53CA;&#x65F6;&#x63A5;&#x53D7;&#x5BF9;&#x65B9;&#x53CD;&#x9988;&#x5E76;&#x8C03;&#x6574;&#x6C9F;&#x901A;&#x65B9;&#x5F0F;&#x3002;&#x6C9F;&#x901A;&#x4E0D;&#x4E00;&#x5B9A;&#x8981;&#x5728;&#x6C9F;&#x901A;&#x5F53;&#x4E0B;&#x5C31;&#x6709;&#x7ED3;&#x679C;&#xFF0C;&#x6C9F;&#x901A;&#x53EF;&#x4EE5;&#x53EA;&#x662F;&#x60F3;&#x6CD5;&#x7684;&#x78B0;&#x649E;&#xFF0C;&#x78B0;&#x649E;&#x540E;&#x7684;&#x601D;&#x8003;&#x53EF;&#x80FD;&#x624D;&#x80FD;&#x627E;&#x5230;&#x95EE;&#x9898;&#x7684;&#x6709;&#x6548;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
</li>
<li><p><strong><em>&#x5DE5;&#x4F5C;&#x6548;&#x7387;&#x9700;&#x8981;&#x63D0;&#x9AD8;</em></strong>&#x3002;&#x5BF9;&#x5F53;&#x524D;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x6548;&#x7387;&#x4E0D;&#x662F;&#x5F88;&#x6EE1;&#x610F;&#xFF0C;&#x81EA;&#x5DF1;&#x662F;&#x4E2A;&#x6162;&#x6027;&#x5B50;&#x7684;&#x4EBA;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x5F88;&#x4F1A;&#x53BB;&#x505A;&#x8BA1;&#x5212;&#x3002;&#x52A0;&#x4E4B;&#x81EA;&#x5DF1;&#x6709;&#x70B9;&#x5F3A;&#x8FEB;&#x75C7;&#xFF0C;&#x6709;&#x4E9B;&#x5DF2;&#x7ECF;&#x5F88;&#x6E05;&#x6670;&#x7684;&#x95EE;&#x9898;&#x4ECD;&#x7136;&#x8981;&#x53BB;&#x53CD;&#x590D;&#x601D;&#x8003;&#xFF0C;&#x8981;&#x60F3;&#x5230;&#x901A;&#x7545;&#x65E0;&#x6BD4;&#x4EE5;&#x786E;&#x8BA4;&#x4E07;&#x65E0;&#x4E00;&#x5931;&#xFF0C;&#x8FD9;&#x662F;&#x5F88;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#x7684;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x8981;&#x505A;&#x5230;&#x5DE5;&#x4F5C;&#x6548;&#x7387;&#x7684;&#x63D0;&#x5347;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x6709;&#x8F83;&#x597D;&#x7684;&#x8BA1;&#x5212;&#x80FD;&#x529B;&#x548C;&#x65F6;&#x95F4;&#x7BA1;&#x7406;&#x80FD;&#x529B;&#x3002;&#x5728;&#x4E2A;&#x4EBA;&#x6027;&#x683C;&#x4E0E;&#x505A;&#x4E8B;&#x65B9;&#x5F0F;&#x4E0A;&#x4E5F;&#x8981;&#x505A;&#x4E9B;&#x76F8;&#x5E94;&#x7684;&#x8C03;&#x6574;&#x3002;</p>
</li>
<li><p><strong><em>&#x4E0D;&#x4EC5;&#x8981;&#x6709;&#x53CD;&#x601D;&#x4E0E;&#x603B;&#x7ED3;&#xFF0C;&#x66F4;&#x8981;&#x6709;&#x6539;&#x53D8;&#x4E0E;&#x63D0;&#x5347;</em></strong>&#x3002;&#x5176;&#x5B9E;&#x968F;&#x7740;&#x5E74;&#x9F84;&#x7684;&#x589E;&#x5927;&#xFF0C;&#x610F;&#x8BC6;&#x5230;&#x81EA;&#x5DF1;&#x5DF2;&#x7ECF;&#x4E0D;&#x518D;&#x662F;&#x4E2A;&#x5B66;&#x751F;&#xFF0C;&#x4E0D;&#x518D;&#x662F;&#x4E2A;&#x957F;&#x4E0D;&#x5927;&#x7684;&#x5B69;&#x5B50;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x4E2A;&#x6210;&#x5E74;&#x4EBA;&#xFF0C;&#x662F;&#x4E2A;&#x804C;&#x573A;&#x4EBA;&#x58EB;&#x4E86;&#x3002;&#x81EA;&#x5DF1;&#x786E;&#x5B9E;&#x6709;&#x505A;&#x4E00;&#x4E9B;&#x53CD;&#x601D;&#xFF0C;&#x6BD4;&#x5982;&#x5728;&#x4E0E;&#x7236;&#x6BCD;&#x6C9F;&#x901A;&#x65B9;&#x9762;&#xFF0C;&#x5728;&#x5DE5;&#x4F5C;&#x4E0A;&#xFF0C;&#x5728;&#x4E2A;&#x4EBA;&#x7F3A;&#x9677;&#x4E0A;&#x9762;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x4E9B;&#x53CD;&#x601D;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x53EA;&#x662F;&#x505C;&#x7559;&#x5728;&#x8111;&#x6D77;&#x91CC;&#xFF0C;&#x6216;&#x8BB8;&#x53CD;&#x601D;&#x51FA;&#x6765;&#x7684;&#x4E1C;&#x897F;&#x662F;&#x5BF9;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x6267;&#x884C;&#xFF0C;&#x6CA1;&#x6709;&#x6539;&#x53D8;&#xFF0C;&#x6CA1;&#x6709;&#x63D0;&#x5347;&#xFF0C;&#x4E0E;&#x6CA1;&#x53CD;&#x601D;&#x6CA1;&#x603B;&#x7ED3;&#x65E0;&#x5F02;&#x3002;</p>
</li>
</ul>
<h3 id="u5B66_u4E60_u4E0A"><a href="#u5B66_u4E60_u4E0A" class="headerlink" title="&#x5B66;&#x4E60;&#x4E0A;"></a>&#x5B66;&#x4E60;&#x4E0A;</h3><ul>
<li><p><strong><em>&#x57F9;&#x517B;&#x5BF9;IT&#x884C;&#x4E1A;&#x7684;&#x70ED;&#x7231;&#x4E0E;&#x6316;&#x6398;&#x5177;&#x4F53;&#x5174;&#x8DA3;&#x70B9;</em></strong>&#x3002;&#x5176;&#x5B9E;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x8BFB;&#x8BA1;&#x7B97;&#x673A;&#xFF1F;&#x56E0;&#x4E3A;&#x9AD8;&#x8003;&#x62A5;&#x5FD7;&#x613F;&#x7684;&#x65F6;&#x5019;&#x6211;&#x54E5;&#x53EB;&#x6211;&#x8BFB;&#x7684;&#xFF0C;&#x4ED6;&#x6709;&#x4E00;&#x4E2A;&#x540C;&#x5B66;&#x4E5F;&#x662F;&#x8BFB;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x8BF4;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x73B0;&#x5728;&#x5F88;&#x706B;&#x3002;&#x5927;&#x5B66;&#x4E5F;&#x662F;&#x6DF7;&#x8FC7;&#x6765;&#x7684;&#xFF0C;&#x4E13;&#x4E1A;&#x8BFE;&#x4E5F;&#x6302;&#x4E86;&#x4E24;&#x95E8;&#xFF0C;&#x66F4;&#x522B;&#x8BF4;&#x57F9;&#x517B;&#x8D77;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x5174;&#x8DA3;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x4ECE;&#x4E8B;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x81EA;&#x5DF1;&#x5C31;&#x662F;&#x8BFB;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#xFF0C;&#x9664;&#x4E86;&#x641E;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8FD8;&#x80FD;&#x641E;&#x4EC0;&#x4E48;&#xFF0C;&#x8FD8;&#x6709;&#x5C31;&#x662F;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x5F85;&#x9047;&#x4E0D;&#x9519;&#x3002;&#x6240;&#x6709;&#x4E25;&#x683C;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x5E76;&#x6CA1;&#x6709;&#x591A;&#x70ED;&#x7231;IT&#x884C;&#x4E1A;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x5F88;&#x5927;&#x5174;&#x8DA3;&#x3002;&#x73B0;&#x5728;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#x53EF;&#x80FD;&#x8FD8;&#x53EA;&#x662F;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#xFF0C;&#x800C;&#x4E14;&#x6211;&#x662F;&#x6CA1;&#x4EC0;&#x4E48;&#x60F3;&#x6CD5;&#x7684;&#x4EBA;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x9886;&#x57DF;&#x7684;&#x4EC0;&#x4E48;&#x80FD;&#x529B;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x53EF;&#x4EE5;&#x9884;&#x89C1;&#x5230;&#x672A;&#x6765;&#x7684;&#x5F88;&#x957F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x6211;&#x5C06;&#x7EE7;&#x7EED;&#x4ECE;&#x4E8B;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x3002;&#x90A3;&#x65E2;&#x7136;&#x5982;&#x6B64;&#xFF0C;&#x4F55;&#x4E0D;&#x5728;&#x5176;&#x4E2D;&#x627E;&#x5230;&#x4E50;&#x8DA3;&#xFF0C;&#x627E;&#x5230;&#x5174;&#x8DA3;&#x70B9;&#x3002;&#x8BA9;&#x5DE5;&#x4F5C;&#x5E26;&#x4E0A;&#x5174;&#x8DA3;&#x7684;&#x7FC5;&#x8180;&#xFF0C;&#x5174;&#x8DA3;&#x7684;&#x57F9;&#x517B;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x6DF1;&#x5165;&#x94BB;&#x7814;&#xFF0C;&#x6DF1;&#x5165;&#x94BB;&#x7814;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x5DE5;&#x4F5C;&#x4E0A;&#x66F4;&#x52A0;&#x5F97;&#x5FC3;&#x5E94;&#x624B;&#xFF0C;&#x83B7;&#x5F97;&#x66F4;&#x591A;&#x62A5;&#x916C;&#x4EE5;&#x53CA;&#x66F4;&#x5FEB;&#x664B;&#x5347;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x57F9;&#x517B;&#x5BF9;IT&#x7684;&#x70ED;&#x7231;&#xFF0C;&#x6316;&#x6398;&#x81EA;&#x5DF1;&#x7684;&#x5174;&#x8DA3;&#x70B9;&#xFF0C;&#x8FD9;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x826F;&#x6027;&#x5FAA;&#x73AF;&#xFF0C;&#x4E8B;&#x60C5;&#x4F1A;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x7F8E;&#x597D;&#x3002;&#x4F46;&#x5982;&#x4F55;&#x53BB;&#x57F9;&#x517B;&#x70ED;&#x7231;&#xFF0C;&#x5982;&#x4F55;&#x53BB;&#x6316;&#x6398;&#x5174;&#x8DA3;&#x5462;? &#x5176;&#x5B9E;&#x6211;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x6211;&#x73B0;&#x5728;&#x91C7;&#x53D6;&#x7684;&#x63AA;&#x65BD;&#x662F;&#x591A;&#x53BB;&#x6D89;&#x730E;&#x4E00;&#x4E9B;IT&#x76F8;&#x5173;&#x7684;&#x8D44;&#x8BAF;&#xFF0C;&#x5728;&#x8FD9;&#x4E9B;&#x8D44;&#x8BAF;&#x4E2D;&#x53BB;&#x5F00;&#x62D3;&#x81EA;&#x5DF1;&#x7684;&#x89C6;&#x91CE;&#xFF0C;&#x53BB;&#x5438;&#x6536;&#x522B;&#x4EBA;&#x7684;&#x60F3;&#x6CD5;&#x3002;&#x5982;&#x679C;&#x80FD;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x6316;&#x6398;&#x51FA;&#x81EA;&#x5DF1;&#x7684;&#x5174;&#x8DA3;&#x70B9;&#xFF0C;&#x90A3;&#x80AF;&#x5B9A;&#x662F;&#x6781;&#x597D;&#x7684;&#x3002;</p>
</li>
<li><p><strong><em>&#x6784;&#x5EFA;&#x81EA;&#x5DF1;&#x7684;&#x77E5;&#x8BC6;&#x50A8;&#x5907;&#x4F53;&#x7CFB;</em></strong>&#x3002;&#x6211;&#x6CA1;&#x6709;&#x5F88;&#x597D;&#x7684;&#x505A;&#x7B14;&#x8BB0;&#x4E60;&#x60EF;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x5199;&#x535A;&#x5BA2;&#x7684;&#x4E60;&#x60EF;&#x3002;&#x8FD9;&#x6837;&#x4F1A;&#x5BFC;&#x81F4;&#x4E4B;&#x524D;&#x9047;&#x5230;&#x8FC7;&#x7684;&#x95EE;&#x9898;&#x6216;&#x8005;&#x5B66;&#x8FC7;&#x7684;&#x6280;&#x672F;&#x9694;&#x6BB5;&#x65F6;&#x95F4;&#x540E;&#x518D;&#x53BB;&#x56DE;&#x60F3;&#x5DF2;&#x7ECF;&#x60F3;&#x4E0D;&#x8D77;&#x6765;&#x4E86;&#xFF0C;&#x53C8;&#x5F97;&#x82B1;&#x51E0;&#x4E4E;&#x540C;&#x6837;&#x7684;&#x7CBE;&#x529B;&#x53BB;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x6216;&#x8005;&#x6E29;&#x4E60;&#x5DF2;&#x7ECF;&#x5FD8;&#x4E86;&#x5DEE;&#x4E0D;&#x591A;&#x7684;&#x6280;&#x672F;&#x3002;&#x597D;&#x8BB0;&#x6027;&#x4E0D;&#x5982;&#x70C2;&#x7B14;&#x5934;&#xFF0C;&#x7B14;&#x8BB0;&#x4E0D;&#x4EC5;&#x53EF;&#x4EE5;&#x5B58;&#x50A8;&#x77E5;&#x8BC6;&#x4E0E;&#x7ECF;&#x9A8C;&#x6559;&#x8BAD;&#xFF0C;&#x800C;&#x4E14;&#x8BB0;&#x7B14;&#x8BB0;&#x7684;&#x540C;&#x65F6;&#x4E5F;&#x52A0;&#x6DF1;&#x4E86;&#x5BF9;&#x77E5;&#x8BC6;&#x7684;&#x719F;&#x6089;&#x4E0E;&#x4E86;&#x89E3;&#x7A0B;&#x5EA6;&#x3002;&#x826F;&#x597D;&#x7684;&#x7B14;&#x8BB0;&#x4E60;&#x60EF;&#xFF0C;&#x826F;&#x597D;&#x7684;&#x4E66;&#x7B7E;&#x7BA1;&#x7406;&#x548C;&#x6587;&#x6863;&#x5F52;&#x7C7B;&#x4E60;&#x60EF;&#xFF0C;&#x80FD;&#x5F88;&#x597D;&#x7684;&#x63D0;&#x9AD8;&#x5DE5;&#x4F5C;&#x6548;&#x7387;&#x4E0E;&#x51CF;&#x4F4E;&#x77E5;&#x8BC6;&#x7684;&#x9057;&#x5FD8;&#x7387;&#x3002;&#x535A;&#x5BA2;&#x4E0E;&#x7B14;&#x8BB0;&#x4E5F;&#x5177;&#x6709;&#x540C;&#x6837;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4F46;&#x535A;&#x5BA2;&#x4E0E;&#x7B14;&#x8BB0;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x7B14;&#x8BB0;&#x662F;&#x5199;&#x7ED9;&#x81EA;&#x5DF1;&#x770B;&#x7684;&#xFF0C;&#x535A;&#x5BA2;&#x662F;&#x5199;&#x7ED9;&#x522B;&#x4EBA;&#x770B;&#x7684;&#xFF0C;&#x662F;&#x628A;&#x77E5;&#x8BC6;&#x4E0E;&#x7ECF;&#x9A8C;&#x4E0E;&#x522B;&#x4EBA;&#x5206;&#x4EAB;&#x7684;&#x4E00;&#x4E2A;&#x5E73;&#x53F0;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5199;&#x535A;&#x5BA2;&#x662F;&#x5F88;&#x80FD;&#x953B;&#x70BC;&#x4E66;&#x9762;&#x7EC4;&#x7EC7;&#x4E0E;&#x8868;&#x8FBE;&#x80FD;&#x529B;&#x7684;&#x3002;&#x535A;&#x5BA2;&#x5728;&#x4E8E;&#x5206;&#x4EAB;&#xFF0C;&#x5F53;&#x628A;&#x4F60;&#x7684;&#x77E5;&#x8BC6;&#x4E0E;&#x7ECF;&#x9A8C;&#x5206;&#x4EAB;&#x7ED9;&#x522B;&#x4EBA;&#x5E76;&#x83B7;&#x5F97;&#x522B;&#x4EBA;&#x8BA4;&#x53EF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E50;&#x8DA3;&#x81EA;&#x7136;&#x5C31;&#x6765;&#x4E86;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x4E0A;&#x6587;&#x57F9;&#x517B;&#x5174;&#x8DA3;&#x70B9;&#x7684;&#x4E00;&#x79CD;&#x5B9E;&#x73B0;&#x9014;&#x5F84;&#x3002;&#x5728;&#x5E74;&#x521D;&#x7684;&#x65F6;&#x5019;&#x6211;&#x5DF2;&#x7ECF;&#x5EFA;&#x7ACB;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x4E2A;&#x4EBA;&#x535A;&#x5BA2;&#xFF0C;&#x867D;&#x7136;&#x8FD8;&#x6CA1;&#x6709;&#x5199;&#x5177;&#x4F53;&#x7684;&#x535A;&#x6587;&#xFF0C;&#x4F46;&#x81F3;&#x5C11;&#x662F;&#x4E2A;&#x5F00;&#x59CB;&#x3002;&#x535A;&#x5BA2;&#x5730;&#x5740;&#xFF1A;www.eddychen.me&#x3002;&#x9664;&#x4E86;&#x7B14;&#x8BB0;&#x3001;&#x535A;&#x5BA2;&#xFF0C;&#x6280;&#x672F;&#x793E;&#x533A;&#x6D3B;&#x8DC3;&#x5EA6;&#x4E5F;&#x662F;&#x6280;&#x672F;&#x50A8;&#x5907;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x73AF;&#x8282;&#x3002;&#x6211;&#x73B0;&#x9636;&#x6BB5;&#x53EA;&#x662F;&#x4EC5;&#x4EC5;&#x5728;github&#x4E0A;&#x9762;&#x7528;&#x7528;&#x522B;&#x4EBA;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#xFF08;&#x8FD8;&#x6709;&#x5C31;&#x662F;&#x6258;&#x7BA1;&#x4E00;&#x4E0B;&#x5B66;&#x4E60;&#x9879;&#x76EE;&#x7684;&#x6E90;&#x7801;&#xFF09;&#xFF0C;&#x5728;stackoverflow&#x4E0A;&#x770B;&#x770B;&#x662F;&#x4E0D;&#x662F;&#x522B;&#x4EBA;&#x66FE;&#x7ECF;&#x9047;&#x5230;&#x8FC7;&#x6211;&#x73B0;&#x5728;&#x6B63;&#x5728;&#x9047;&#x5230;&#x7684;&#x95EE;&#x9898;&#x3002;&#x81F3;&#x4E8E;&#x6D3B;&#x8DC3;&#x5EA6;&#xFF0C;&#x6839;&#x672C;&#x5C31;&#x662F;&#x96F6;&#x3002;&#x4E5F;&#x4E3A;&#x81EA;&#x5DF1;&#x627E;&#x8FC7;&#x501F;&#x53E3;&#xFF0C;&#x5199;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#xFF0C;&#x5728;&#x6280;&#x672F;&#x5E73;&#x53F0;&#x4E0A;&#x53D1;&#x8868;&#x6587;&#x7AE0;&#x6216;&#x8005;&#x56DE;&#x7B54;&#x522B;&#x4EBA;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x662F;&#x5927;&#x795E;&#x4EEC;&#x624D;&#x505A;&#x7684;&#x4E8B;&#xFF0C;&#x6211;&#x5C31;&#x4E00;&#x6E23;&#x6E23;&#x3002;&#x4F46;&#x5FC3;&#x91CC;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x5C0F;&#x4EBA;&#x4E5F;&#x5728;&#x505A;&#x6297;&#x4E89;&#xFF0C;&#x793E;&#x533A;&#x7684;&#x6D3B;&#x8DC3;&#x5EA6;&#x5176;&#x5B9E;&#x662F;&#x4F60;&#x7684;&#x4E2A;&#x4EBA;&#x7B80;&#x5386;&#xFF0C;&#x80FD;&#x63D0;&#x9AD8;&#x4F60;&#x7684;&#x4E2A;&#x4EBA;&#x7ADE;&#x4E89;&#x529B;&#xFF0C;&#x540C;&#x65F6;&#xFF0C;&#x6280;&#x672F;&#x793E;&#x533A;&#x4E5F;&#x80FD;&#x57F9;&#x517B;&#x4F60;&#x5BF9;IT&#x5F00;&#x53D1;&#x7684;&#x70ED;&#x7231;&#x3002;&#x505A;&#x7B14;&#x8BB0;&#xFF0C;&#x5199;&#x535A;&#x5BA2;&#xFF0C;&#x6D3B;&#x8DC3;&#x4E8E;&#x793E;&#x533A;&#xFF0C;&#x8FD9;&#x90FD;&#x662F;&#x8981;&#x5FAA;&#x5E8F;&#x6E10;&#x8FDB;&#xFF0C;&#x4E0D;&#x662F;&#x4E00;&#x8E74;&#x800C;&#x5C31;&#x7684;&#x3002;&#x5176;&#x5B9E;&#x8003;&#x9A8C;&#x7684;&#x662F;&#x8010;&#x5FC3;&#x4E0E;&#x575A;&#x6301;&#xFF0C;&#x57F9;&#x517B;&#x51FA;&#x6765;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x4E60;&#x60EF;&#xFF0C;&#x800C;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x4E60;&#x60EF;&#x662F;&#x80FD;&#x5E26;&#x6765;&#x8BF8;&#x591A;&#x597D;&#x5904;&#x7684;&#x3002;</p>
</li>
<li><p><strong><em>&#x63D0;&#x5347;&#x82F1;&#x8BED;&#x6C34;&#x5E73;</em></strong>&#x3002;&#x6211;&#x662F;&#x4E00;&#x4E2A;&#x53EA;&#x8FC7;&#x4E86;&#x5927;&#x5B66;&#x56DB;&#x7EA7;&#x7684;&#x82F1;&#x8BED;&#x83DC;&#x9E1F;&#xFF0C;&#x4F46;&#x662F;&#x82F1;&#x8BED;&#x80FD;&#x529B;&#x5374;&#x53C8;&#x662F;&#x7A0B;&#x5E8F;&#x733F;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x80FD;&#x529B;&#x3002;&#x67E5;&#x9605;&#x6280;&#x672F;&#x6587;&#x6863;&#xFF0C;google&#x641C;&#x7D22;&#xFF0C;&#x52A0;&#x4E4B;&#x53C8;&#x5904;&#x4E8E;&#x5916;&#x4F01;&#xFF0C;IM&#x3001;&#x90AE;&#x4EF6;&#x7B49;&#x90FD;&#x8981;&#x6C42;&#x82F1;&#x8BED;&#xFF0C;&#x6240;&#x4EE5;&#x82F1;&#x8BED;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#x663E;&#x5F97;&#x66F4;&#x4E3A;&#x91CD;&#x8981;&#xFF0C;&#x51B5;&#x4E14;&#x6280;&#x591A;&#x4E0D;&#x538B;&#x8EAB;&#x3002;&#x5176;&#x5B9E;&#x6211;&#x4E5F;&#x6709;&#x610F;&#x8BC6;&#x5730;&#x5728;&#x63D0;&#x9AD8;&#x81EA;&#x5DF1;&#x7684;&#x82F1;&#x8BED;&#x80FD;&#x529B;&#xFF0C;&#x5F53;&#x7136;&#x66F4;&#x591A;&#x662F;&#x5199;&#x4F5C;&#x4E0E;&#x9605;&#x8BFB;&#x80FD;&#x529B;&#x3002;&#x73B0;&#x5728;&#x6BCF;&#x5929;&#x65E9;&#x4E0A;&#x8FB9;&#x5403;&#x65E9;&#x9910;&#x4F1A;&#x8FB9;&#x770B;&#x4E00;&#x7BC7;&#x53CC;&#x8BED;&#x9605;&#x8BFB;&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x5E73;&#x65F6;&#x9047;&#x5230;&#x4E0D;&#x61C2;&#x7684;&#x5355;&#x8BCD;&#x4E5F;&#x4F1A;&#x53BB;&#x67E5;&#xFF0C;&#x53BB;&#x8BB0;&#xFF0C;&#x5373;&#x4F7F;&#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#x53EF;&#x80FD;&#x4E0D;&#x5BF9;&#x6574;&#x53E5;&#x8BDD;&#x7684;&#x7406;&#x89E3;&#x5E26;&#x6765;&#x95EE;&#x9898;&#x3002;&#x770B;&#x7F8E;&#x5267;&#x7684;&#x8FD9;&#x4E2A;&#x7231;&#x597D;&#x5BF9;&#x63D0;&#x5347;&#x6211;&#x7684;&#x82F1;&#x8BED;&#x80FD;&#x529B;&#x4E5F;&#x6709;&#x90A3;&#x4E48;&#x4E00;&#x70B9;&#x70B9;&#x5E2E;&#x52A9;&#xFF0C;&#x6211;&#x6709;&#x5F3A;&#x8FEB;&#x81EA;&#x5DF1;&#x53BB;&#x770B;&#x82F1;&#x6587;&#x5B57;&#x5E55;&#x800C;&#x5FFD;&#x7565;&#x4E2D;&#x6587;&#x5B57;&#x5E55;&#xFF0C;&#x4F46;&#x6709;&#x65F6;&#x5019;&#x7CBE;&#x5F69;&#x7684;&#x5267;&#x60C5;&#x4F1A;&#x6BD4;&#x5B66;&#x4E60;&#x82F1;&#x8BED;&#x66F4;&#x52A0;&#x5438;&#x5F15;&#x4F60;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4E0D;&#x662F;&#x4ECE;&#x4E8B;&#x82F1;&#x8BED;&#x76F8;&#x5173;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x4E0D;&#x4F1A;&#x523B;&#x610F;&#x53BB;&#x50CF;&#x5728;&#x5927;&#x5B66;&#x65F6;&#x4EE3;&#x4E00;&#x6837;&#x53BB;&#x5B66;&#x4E60;&#x82F1;&#x8BED;&#xFF0C;&#x66F4;&#x5E0C;&#x671B;&#x662F;&#x5728;&#x9891;&#x7E41;&#x4F7F;&#x7528;&#xFF0C;&#x6709;&#x610F;&#x8BC6;&#x7684;&#x6F5C;&#x79FB;&#x9ED8;&#x5316;&#x4E2D;&#x53BB;&#x63D0;&#x9AD8;&#x3002;</p>
</li>
</ul>
<h3 id="u751F_u6D3B_u4E0A"><a href="#u751F_u6D3B_u4E0A" class="headerlink" title="&#x751F;&#x6D3B;&#x4E0A;"></a>&#x751F;&#x6D3B;&#x4E0A;</h3><ul>
<li><p><strong><em>&#x89C4;&#x5F8B;&#x4F5C;&#x606F;&#x65F6;&#x95F4;&#xFF0C;&#x591A;&#x953B;&#x70BC;&#x8EAB;&#x4F53;</em></strong>&#x3002;&#x8EAB;&#x4F53;&#x662F;&#x9769;&#x547D;&#x7684;&#x672C;&#x94B1;&#x3002;</p>
</li>
<li><p><strong><em>&#x591A;&#x53C2;&#x4E0E;&#x4E00;&#x4E9B;&#x793E;&#x4EA4;&#x6D3B;&#x52A8;</em></strong>&#x3002;&#x6CA1;&#x4E8B;&#x53EF;&#x4EE5;&#x7ECF;&#x5E38;&#x8DD1;&#x6DF1;&#x5733;&#x3001;&#x5E7F;&#x5DDE;&#x627E;&#x5C0F;&#x4F19;&#x4F34;&#x4EEC;&#x4E00;&#x8D77;&#x73A9;&#x800D;&#xFF0C;&#x6BD5;&#x7ADF;&#x5728;&#x73E0;&#x6D77;&#x5DE5;&#x4F5C;&#x7684;&#x670B;&#x53CB;&#x592A;&#x5C11;&#x4E86;&#x3002;</p>
</li>
<li><p><strong><em>&#x57F9;&#x517B;&#x4E00;&#x4E9B;&#x6237;&#x5916;&#x5174;&#x8DA3;&#x7231;&#x597D;</em></strong>&#x3002;&#x5982;&#x9A91;&#x8F66;&#x3001;&#x5F92;&#x6B65;&#x7B49;&#x3002;</p>
</li>
</ul>
<p>&#x4EE5;&#x4E0A;&#x6240;&#x8FF0;&#x4E0D;&#x80FD;&#x8BF4;&#x662F;&#x603B;&#x7ED3;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x8BF4;&#x662F;&#x8BA1;&#x5212;&#x3002;&#x53EA;&#x662F;&#x4E00;&#x4E9B;2016&#x5E74;&#x4E00;&#x4E9B;&#x5927;&#x81F4;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x884C;&#x52A8;&#x5F80;&#x5F80;&#x6BD4;&#x7EB8;&#x4E0A;&#x8C08;&#x5175;&#x66F4;&#x6709;&#x8BF4;&#x670D;&#x529B;&#xFF0C;&#x5E0C;&#x671B;2017&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x518D;&#x56DE;&#x5934;&#x770B;&#x60F3;&#x6CD5;&#x5DF2;&#x6210;&#x4E3A;&#x73B0;&#x5B9E;&#x3002;</p>

                    
                        

                    
                    
                        <p>
                            <a href="/2016/02/23/expectations_in_2016/#post-footer" class="postShorten-excerpt_link link">
                                Comment and share
                            </a>
                        </p>
                    
                </div>
            
        </div>
        
    </article>
    
    <div class="pagination-bar">
    <ul class="pagination">
        
        
        <li class="pagination-number">page 1 of 1</li>
    </ul>
</div>

</section>



                <footer id="footer" class="main-content-wrap">
    <span class="copyrights">
        Copyrights &copy; 2016 Eddy Chen. All Rights Reserved.
    </span>
</footer>

            </div>
            
        </div>
        


    
        
    

<div id="about">
    <div id="about-card">
        <div id="about-btn-close">
            <i class="fa fa-remove"></i>
        </div>
        
            <img id="about-card-picture" src="/assets/images/cover.jpg"/>
        
            <h4 id="about-card-name">Eddy Chen</h4>
        
            <h5 id="about-card-bio"><p>To Be Better</p>
</h5>
        
        
            <h5 id="about-card-job">
                <i class="fa fa-briefcase"></i>
                <br/>
                <p>Software Engineer</p>

            </h5>
        
        
            <h5 id="about-card-location">
                <i class="fa fa-map-marker"></i>
                <br/>
                ZHA, China
            </h5>
        
    </div>
</div>

        
<div id="cover" style="background-image:url('/assets/images/cover.jpg');"></div>
    </body>
    <!--SCRIPTS-->
<script src="/assets/js/scrip-gfmrkxcl0qohe3cfdgxhzvc0yrceqta8i4iix0txvn8q4o2adlqd5n0jmkvt.min.js" type="text/javascript"></script>
<!--SCRIPTS END-->


    <script type="text/javascript">
        (function(w,d,t,u,n,s,e){w['SwiftypeObject']=n;w[n]=w[n]||function(){
                (w[n].q=w[n].q||[]).push(arguments);};s=d.createElement(t);
            e=d.getElementsByTagName(t)[0];s.async=1;s.src=u;e.parentNode.insertBefore(s,e);
        })(window,document,'script','//s.swiftypecdn.com/install/v2/st.js','_st');

        _st('install','rxgJZPSW_LpZTuK6DysC','2.0.0');
    </script>


</html>
